gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_ctwing/Hardware/NET/net_nbiot_app.c
void NET_NBIOT_CoapInfoStructureInit(void)
{
	memset((void*)&CoapInfoStructure.InfoData, 0, sizeof(CoapInfoStructure.InfoData));
	CoapInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CoapInfoStructure.HeadPacket.DataLen					= 0x00;
	CoapInfoStructure.HeadPacket.ProtocolType				= 0x00;
	CoapInfoStructure.HeadPacket.Reserved1					= 0x00;
	CoapInfoStructure.HeadPacket.ProtocolVersion				= 0x00;
	CoapInfoStructure.HeadPacket.Reserved2					= 0x00;
	CoapInfoStructure.HeadPacket.PacketType					= 0x05;
	CoapInfoStructure.HeadPacket.PacketNumber				= 0x00;
	CoapInfoStructure.MsgPacket.DestSN						= 0x00;
	CoapInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CoapSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBCOAP_LISTEN_PARAMETER_TYPE == NBCOAP_LISTEN_PARAMETER_ENABLE
	NbiotClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

#if NETPROTOCAL == NETMQTTSN
void NET_NBIOT_MqttSNShortStructureInit(void)
{
	MqttSNShortStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	MqttSNShortStructure.HeadPacket.DataLen					= 0x00;
	MqttSNShortStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNShortStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNShortStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNShortStructure.HeadPacket.PacketType				= 0x05;
	MqttSNShortStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNShortStructure.MsgPacket.DestSN					= 0x00;
	MqttSNShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_MqttSNLongStructureInit(void)
{
	MqttSNLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	MqttSNLongStructure.HeadPacket.DataLen					= 0x00;
	MqttSNLongStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNLongStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNLongStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNLongStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNLongStructure.HeadPacket.PacketType				= 0x05;
	MqttSNLongStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNLongStructure.MsgPacket.DestSN					= 0x00;
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V1
	MqttSNLongStructure.MsgPacket.Version					= 0x01;
#elif MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
	MqttSNLongStructure.MsgPacket.Version					= 0x02;
#endif
}

void NET_NBIOT_MqttSNInfoStructureInit(void)
{
	memset((void*)&MqttSNInfoStructure.InfoData, 0, sizeof(MqttSNInfoStructure.InfoData));
	MqttSNInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	MqttSNInfoStructure.HeadPacket.DataLen					= 0x00;
	MqttSNInfoStructure.HeadPacket.ProtocolType				= 0x00;
	MqttSNInfoStructure.HeadPacket.Reserved1				= 0x00;
	MqttSNInfoStructure.HeadPacket.ProtocolVersion			= 0x00;
	MqttSNInfoStructure.HeadPacket.Reserved2				= 0x00;
	MqttSNInfoStructure.HeadPacket.PacketType				= 0x05;
	MqttSNInfoStructure.HeadPacket.PacketNumber				= 0x00;
	MqttSNInfoStructure.MsgPacket.DestSN					= 0x00;
	MqttSNInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_MqttSNSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBMQTTSN_LISTEN_PARAMETER_TYPE == NBMQTTSN_LISTEN_PARAMETER_ENABLE
	MqttSNClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

#if NETPROTOCAL == NETONENET
void NET_NBIOT_OneNETShortStructureInit(void)
{
	OneNETShortStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	OneNETShortStructure.HeadPacket.DataLen					= 0x00;
	OneNETShortStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETShortStructure.HeadPacket.Reserved1				= 0x00;
	OneNETShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETShortStructure.HeadPacket.Reserved2				= 0x00;
	OneNETShortStructure.HeadPacket.PacketType				= 0x05;
	OneNETShortStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETShortStructure.MsgPacket.DestSN					= 0x00;
	OneNETShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_OneNETLongStructureInit(void)
{
	OneNETLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	OneNETLongStructure.HeadPacket.DataLen					= 0x00;
	OneNETLongStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETLongStructure.HeadPacket.Reserved1				= 0x00;
	OneNETLongStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETLongStructure.HeadPacket.Reserved2				= 0x00;
	OneNETLongStructure.HeadPacket.PacketType				= 0x05;
	OneNETLongStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETLongStructure.MsgPacket.DestSN					= 0x00;
#if ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_33BYTE_V1
	OneNETLongStructure.MsgPacket.Version					= 0x01;
#elif ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_77BYTE_V2
	OneNETLongStructure.MsgPacket.Version					= 0x02;
#endif
}

void NET_NBIOT_OneNETInfoStructureInit(void)
{
	memset((void*)&OneNETInfoStructure.InfoData, 0, sizeof(OneNETInfoStructure.InfoData));
	OneNETInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	OneNETInfoStructure.HeadPacket.DataLen					= 0x00;
	OneNETInfoStructure.HeadPacket.ProtocolType				= 0x00;
	OneNETInfoStructure.HeadPacket.Reserved1				= 0x00;
	OneNETInfoStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETInfoStructure.HeadPacket.Reserved2				= 0x00;
	OneNETInfoStructure.HeadPacket.PacketType				= 0x05;
	OneNETInfoStructure.HeadPacket.PacketNumber				= 0x00;
	OneNETInfoStructure.MsgPacket.DestSN					= 0x00;
	OneNETInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_OneNETSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBONENET_LISTEN_PARAMETER_TYPE == NBONENET_LISTEN_PARAMETER_ENABLE
	OneNETClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

#if NETPROTOCAL == NETCTWING
void NET_NBIOT_CTWingShortStructureInit(void)
{
	CTWingShortStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	CTWingShortStructure.HeadPacket.DataLen					= 0x00;
	CTWingShortStructure.HeadPacket.ProtocolType				= 0x00;
	CTWingShortStructure.HeadPacket.Reserved1				= 0x00;
	CTWingShortStructure.HeadPacket.ProtocolVersion			= 0x00;
	CTWingShortStructure.HeadPacket.Reserved2				= 0x00;
	CTWingShortStructure.HeadPacket.PacketType				= 0x05;
	CTWingShortStructure.HeadPacket.PacketNumber				= 0x00;
	CTWingShortStructure.MsgPacket.DestSN					= 0x00;
	CTWingShortStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CTWingLongStructureInit(void)
{
	CTWingLongStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CTWingLongStructure.HeadPacket.DataLen					= 0x00;
	CTWingLongStructure.HeadPacket.ProtocolType				= 0x00;
	CTWingLongStructure.HeadPacket.Reserved1				= 0x00;
	CTWingLongStructure.HeadPacket.ProtocolVersion			= 0x00;
	CTWingLongStructure.HeadPacket.Reserved2				= 0x00;
	CTWingLongStructure.HeadPacket.PacketType				= 0x05;
	CTWingLongStructure.HeadPacket.PacketNumber				= 0x00;
	CTWingLongStructure.MsgPacket.DestSN					= 0x00;
#if CTWING_STATUS_MSG_VERSION_TYPE == CTWING_STATUS_MSG_VERSION_33BYTE_V1
	CTWingLongStructure.MsgPacket.Version					= 0x01;
#elif CTWING_STATUS_MSG_VERSION_TYPE == CTWING_STATUS_MSG_VERSION_77BYTE_V2
	CTWingLongStructure.MsgPacket.Version					= 0x02;
#endif
}

void NET_NBIOT_CTWingInfoStructureInit(void)
{
	memset((void*)&CTWingInfoStructure.InfoData, 0, sizeof(CTWingInfoStructure.InfoData));
	CTWingInfoStructure.HeadPacket.DeviceSN					= TCFG_EEPROM_Get_MAC_SN();
	CTWingInfoStructure.HeadPacket.DataLen					= 0x00;
	CTWingInfoStructure.HeadPacket.ProtocolType				= 0x00;
	CTWingInfoStructure.HeadPacket.Reserved1				= 0x00;
	CTWingInfoStructure.HeadPacket.ProtocolVersion			= 0x00;
	CTWingInfoStructure.HeadPacket.Reserved2				= 0x00;
	CTWingInfoStructure.HeadPacket.PacketType				= 0x05;
	CTWingInfoStructure.HeadPacket.PacketNumber				= 0x00;
	CTWingInfoStructure.MsgPacket.DestSN					= 0x00;
	CTWingInfoStructure.MsgPacket.Version					= 0x01;
}

void NET_NBIOT_CTWingSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
#if NBCTWING_LISTEN_PARAMETER_TYPE == NBCTWING_LISTEN_PARAMETER_ENABLE
	CTWingClientHandler.ListenRunCtl.ListenEnterParameter.listenEnable = true;
#endif
}
#endif

/**********************************************************************************************************
 @Function			void NET_NBIOT_DataProcessing(NET_NBIOT_ClientsTypeDef* pClient)
 @Description			NET_NBIOT_DataProcessing						: NET数据处理
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_DataProcessing(NET_NBIOT_ClientsTypeDef* pClient)
{
#ifndef NETPROTOCAL
	#error No Define NETPROTOCAL!
#else
#if NETPROTOCAL == NETCOAP
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBCOAP_SENDCODE_LONG_STATUS
		NETCoapNeedSendCode.LongStatus = 1;
	#endif
	}
	
