gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot_ctwing/Hardware/NET/net_nbiot_app.c
	/* COAP SHORT STATUS DATA ENQUEUE */
	if (NETCoapNeedSendCode.ShortStatus) {
#if NBCOAP_SENDCODE_SHORT_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CoapShortStructureInit();
		CoapShortStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_SHORT_STATUS;
		CoapShortStructure.DateTime						= SpotStatusData.unixTime;
		CoapShortStructure.SpotStatus						= SpotStatusData.spot_status;
		CoapShortStructure.SpotCount						= SpotStatusData.spot_count;
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapShortStructure, sizeof(CoapShortStructure));
		NETCoapNeedSendCode.ShortStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP LONG STATUS DATA ENQUEUE */
	else if (NETCoapNeedSendCode.LongStatus) {
#if NBCOAP_SENDCODE_LONG_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CoapLongStructureInit();
		CoapLongStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_LONG_STATUS;
		CoapLongStructure.DateTime						= SpotStatusData.unixTime;
		CoapLongStructure.SpotStatus						= SpotStatusData.spot_status;
		CoapLongStructure.SpotCount						= SpotStatusData.spot_count;
		CoapLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		CoapLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		CoapLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		CoapLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		CoapLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		CoapLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		CoapLongStructure.RadarCoverCount					= SpotStatusData.radarData.Diff_v2;
		CoapLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if NBIOT_STATUS_MSG_VERSION_TYPE == NBIOT_STATUS_MSG_VERSION_77BYTE_V2
		CoapLongStructure.NBRssi							= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		CoapLongStructure.NBSnr							= TCFG_Utility_Get_Nbiot_RadioSNR();
		CoapLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		CoapLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		CoapLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		CoapLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		CoapLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		CoapLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			CoapLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			CoapLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapLongStructure, sizeof(CoapLongStructure));
		NETCoapNeedSendCode.LongStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP WORK INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.WorkInfo) {
#if NBCOAP_SENDCODE_WORK_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_WORK_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Work_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.WorkInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP BASIC INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.BasicInfo) {
#if NBCOAP_SENDCODE_BASIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Basic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.BasicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP DYNAMIC INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.DynamicInfo) {
#if NBCOAP_SENDCODE_DYNAMIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Dynamic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP RESPONSE INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.ResponseInfo) {
#if NBCOAP_SENDCODE_RESPONSE_INFO
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.HeadPacket.PacketType				= 0x05;
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Response_Info((char *)&CoapInfoStructure.InfoData, NETCoapNeedSendCode.ResponseInfoErrcode, NETCoapNeedSendCode.ResponseInfoMsgId);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.ResponseInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	
#elif NETPROTOCAL == NETMQTTSN
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBMQTTSN_SENDCODE_STATUS_EXTEND
		NETMqttSNNeedSendCode.StatusExtend = 1;
	#endif
	}
	
	/* MQTTSN SHORT STATUS DATA ENQUEUE */
	if (NETMqttSNNeedSendCode.StatusBasic) {
#if NBMQTTSN_SENDCODE_STATUS_BASIC
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_MqttSNShortStructureInit();
		MqttSNShortStructure.MsgPacket.Type				= MQTTSN_MSGTYPE_TYPE_SHORT_STATUS;
		MqttSNShortStructure.DateTime						= SpotStatusData.unixTime;
		MqttSNShortStructure.SpotStatus					= SpotStatusData.spot_status;
		MqttSNShortStructure.SpotCount					= SpotStatusData.spot_count;
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNShortStructure, sizeof(MqttSNShortStructure));
		NETMqttSNNeedSendCode.StatusBasic = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	/* MQTTSN LONG STATUS DATA ENQUEUE */
	else if (NETMqttSNNeedSendCode.StatusExtend) {
#if NBMQTTSN_SENDCODE_STATUS_EXTEND
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_MqttSNLongStructureInit();
		MqttSNLongStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_LONG_STATUS;
		MqttSNLongStructure.DateTime						= SpotStatusData.unixTime;
		MqttSNLongStructure.SpotStatus					= SpotStatusData.spot_status;
		MqttSNLongStructure.SpotCount						= SpotStatusData.spot_count;
		MqttSNLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		MqttSNLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		MqttSNLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		MqttSNLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		MqttSNLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		MqttSNLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		MqttSNLongStructure.RadarCoverCount				= SpotStatusData.radarData.Diff_v2;
		MqttSNLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if MQTTSN_STATUS_MSG_VERSION_TYPE == MQTTSN_STATUS_MSG_VERSION_V2
		MqttSNLongStructure.NBRssi						= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		MqttSNLongStructure.NBSnr						= TCFG_Utility_Get_Nbiot_RadioSNR();
		MqttSNLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		MqttSNLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		MqttSNLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		MqttSNLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		MqttSNLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		MqttSNLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			MqttSNLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			MqttSNLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNLongStructure, sizeof(MqttSNLongStructure));
		NETMqttSNNeedSendCode.StatusExtend = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	/* MQTTSN INFO WORK DATA ENQUEUE */
	else if (NETMqttSNNeedSendCode.InfoWork) {
#if NBMQTTSN_SENDCODE_WORK_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_WORK_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Work_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoWork = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	/* MQTTSN INFO BASIC DATA ENQUEUE */
	else if (NETMqttSNNeedSendCode.InfoBasic) {
#if NBMQTTSN_SENDCODE_BASIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Basic_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoBasic = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	/* MQTTSN INFO DYNAMIC DATA ENQUEUE */
	else if (NETMqttSNNeedSendCode.InfoDynamic) {
#if NBMQTTSN_SENDCODE_DYNAMIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Dynamic_Info((char *)&MqttSNInfoStructure.InfoData);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoDynamic = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	/* MQTTSN INFO RESPONSE DATA ENQUEUE */
	else if (NETMqttSNNeedSendCode.InfoResponse) {
#if NBMQTTSN_SENDCODE_RESPONSE_INFO
		NET_NBIOT_MqttSNInfoStructureInit();
		MqttSNInfoStructure.HeadPacket.PacketType			= 0x05;
		MqttSNInfoStructure.MsgPacket.Type					= MQTTSN_MSGTYPE_TYPE_INFO;
		len = NET_MQTTSN_Message_Operate_Creat_Json_Response_Info((char *)&MqttSNInfoStructure.InfoData, NETMqttSNNeedSendCode.InfoResponseErrcode, NETMqttSNNeedSendCode.InfoResponseMsgId);
		NET_MqttSN_Message_SendDataEnqueue((unsigned char *)&MqttSNInfoStructure, sizeof(MqttSNInfoStructure) - sizeof(MqttSNInfoStructure.InfoData) + len);
		NETMqttSNNeedSendCode.InfoResponse = 0;
		NET_NBIOT_MqttSNSentDataAfterExexution();
#endif
	}
	
#elif NETPROTOCAL == NETONENET
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBONENET_SENDCODE_LONG_STATUS
		NETOneNETNeedSendCode.LongStatus = 1;
	#endif
	}
	
	/* ONENET SHORT STATUS DATA ENQUEUE */
	if (NETOneNETNeedSendCode.ShortStatus) {
#if NBONENET_SENDCODE_SHORT_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_OneNETShortStructureInit();
		OneNETShortStructure.MsgPacket.Type				= ONENET_MSGTYPE_TYPE_SHORT_STATUS;
		OneNETShortStructure.DateTime						= SpotStatusData.unixTime;
		OneNETShortStructure.SpotStatus					= SpotStatusData.spot_status;
		OneNETShortStructure.SpotCount					= SpotStatusData.spot_count;
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETShortStructure, sizeof(OneNETShortStructure));
		NETOneNETNeedSendCode.ShortStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	/* ONENET LONG STATUS DATA ENQUEUE */
	else if (NETOneNETNeedSendCode.LongStatus) {
#if NBONENET_SENDCODE_LONG_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_OneNETLongStructureInit();
		OneNETLongStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_LONG_STATUS;
		OneNETLongStructure.DateTime						= SpotStatusData.unixTime;
		OneNETLongStructure.SpotStatus					= SpotStatusData.spot_status;
		OneNETLongStructure.SpotCount						= SpotStatusData.spot_count;
		OneNETLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		OneNETLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		OneNETLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		OneNETLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		OneNETLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		OneNETLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		OneNETLongStructure.RadarCoverCount				= SpotStatusData.radarData.Diff_v2;
		OneNETLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if ONENET_STATUS_MSG_VERSION_TYPE == ONENET_STATUS_MSG_VERSION_77BYTE_V2
		OneNETLongStructure.NBRssi						= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		OneNETLongStructure.NBSnr						= TCFG_Utility_Get_Nbiot_RadioSNR();
		OneNETLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		OneNETLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		OneNETLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		OneNETLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		OneNETLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		OneNETLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			OneNETLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			OneNETLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETLongStructure, sizeof(OneNETLongStructure));
		NETOneNETNeedSendCode.LongStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	/* ONENET WORK INFO DATA ENQUEUE */
	else if (NETOneNETNeedSendCode.WorkInfo) {
#if NBONENET_SENDCODE_WORK_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_WORK_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Work_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.WorkInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	/* ONENET BASIC INFO DATA ENQUEUE */
	else if (NETOneNETNeedSendCode.BasicInfo) {
#if NBONENET_SENDCODE_BASIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Basic_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.BasicInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	/* ONENET DYNAMIC INFO DATA ENQUEUE */
	else if (NETOneNETNeedSendCode.DynamicInfo) {
#if NBONENET_SENDCODE_DYNAMIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Dynamic_Info((char *)&OneNETInfoStructure.InfoData);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	/* ONENET RESPONSE INFO DATA ENQUEUE */
	else if (NETOneNETNeedSendCode.ResponseInfo) {
#if NBONENET_SENDCODE_RESPONSE_INFO
		NET_NBIOT_OneNETInfoStructureInit();
		OneNETInfoStructure.HeadPacket.PacketType			= 0x05;
		OneNETInfoStructure.MsgPacket.Type					= ONENET_MSGTYPE_TYPE_INFO;
		len = NET_ONENET_Message_Operate_Creat_Json_Response_Info((char *)&OneNETInfoStructure.InfoData, NETOneNETNeedSendCode.ResponseInfoErrcode, NETOneNETNeedSendCode.ResponseInfoMsgId);
		NET_OneNET_Message_SendDataEnqueue((unsigned char *)&OneNETInfoStructure, sizeof(OneNETInfoStructure) - sizeof(OneNETInfoStructure.InfoData) + len);
		NETOneNETNeedSendCode.ResponseInfo = 0;
		NET_NBIOT_OneNETSentDataAfterExexution();
#endif
	}
	
#elif NETPROTOCAL == NETCTWING
	
	u32 len = 0;
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBCTWING_SENDCODE_LONG_STATUS
		NETCTWingNeedSendCode.LongStatus = 1;
	#endif
	}
	
